Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64GP802.h
#define _DCICON2_WS3_POSITION                    0x00000003
#define _DCICON2_WS3_MASK                        0x00000008
#define _DCICON2_WS3_LENGTH                      0x00000001

#define _DCICON2_COFSG0_POSITION                 0x00000005
#define _DCICON2_COFSG0_MASK                     0x00000020
#define _DCICON2_COFSG0_LENGTH                   0x00000001

#define _DCICON2_COFSG1_POSITION                 0x00000006
#define _DCICON2_COFSG1_MASK                     0x00000040
#define _DCICON2_COFSG1_LENGTH                   0x00000001

#define _DCICON2_COFSG2_POSITION                 0x00000007
#define _DCICON2_COFSG2_MASK                     0x00000080
#define _DCICON2_COFSG2_LENGTH                   0x00000001

#define _DCICON2_COFSG3_POSITION                 0x00000008
#define _DCICON2_COFSG3_MASK                     0x00000100
#define _DCICON2_COFSG3_LENGTH                   0x00000001

#define _DCICON2_BLEN0_POSITION                  0x0000000A
#define _DCICON2_BLEN0_MASK                      0x00000400
#define _DCICON2_BLEN0_LENGTH                    0x00000001

#define _DCICON2_BLEN1_POSITION                  0x0000000B
#define _DCICON2_BLEN1_MASK                      0x00000800
#define _DCICON2_BLEN1_LENGTH                    0x00000001

#define _DCICON3_BCG_POSITION                    0x00000000
#define _DCICON3_BCG_MASK                        0x00000FFF
#define _DCICON3_BCG_LENGTH                      0x0000000C

#define _DCISTAT_TMPTY_POSITION                  0x00000000
#define _DCISTAT_TMPTY_MASK                      0x00000001
#define _DCISTAT_TMPTY_LENGTH                    0x00000001

#define _DCISTAT_TUNF_POSITION                   0x00000001
#define _DCISTAT_TUNF_MASK                       0x00000002
#define _DCISTAT_TUNF_LENGTH                     0x00000001

#define _DCISTAT_RFUL_POSITION                   0x00000002
#define _DCISTAT_RFUL_MASK                       0x00000004
#define _DCISTAT_RFUL_LENGTH                     0x00000001

#define _DCISTAT_ROV_POSITION                    0x00000003
#define _DCISTAT_ROV_MASK                        0x00000008
#define _DCISTAT_ROV_LENGTH                      0x00000001

#define _DCISTAT_SLOT_POSITION                   0x00000008
#define _DCISTAT_SLOT_MASK                       0x00000F00
#define _DCISTAT_SLOT_LENGTH                     0x00000004

#define _DCISTAT_SLOT0_POSITION                  0x00000008
#define _DCISTAT_SLOT0_MASK                      0x00000100
#define _DCISTAT_SLOT0_LENGTH                    0x00000001

#define _DCISTAT_SLOT1_POSITION                  0x00000009
#define _DCISTAT_SLOT1_MASK                      0x00000200
#define _DCISTAT_SLOT1_LENGTH                    0x00000001

#define _DCISTAT_SLOT2_POSITION                  0x0000000A
#define _DCISTAT_SLOT2_MASK                      0x00000400
#define _DCISTAT_SLOT2_LENGTH                    0x00000001

#define _DCISTAT_SLOT3_POSITION                  0x0000000B
#define _DCISTAT_SLOT3_MASK                      0x00000800
#define _DCISTAT_SLOT3_LENGTH                    0x00000001

#define _TSCON_TSE0_POSITION                     0x00000000
#define _TSCON_TSE0_MASK                         0x00000001
#define _TSCON_TSE0_LENGTH                       0x00000001

#define _TSCON_TSE1_POSITION                     0x00000001
#define _TSCON_TSE1_MASK                         0x00000002
#define _TSCON_TSE1_LENGTH                       0x00000001

#define _TSCON_TSE2_POSITION                     0x00000002
#define _TSCON_TSE2_MASK                         0x00000004
#define _TSCON_TSE2_LENGTH                       0x00000001

#define _TSCON_TSE3_POSITION                     0x00000003
#define _TSCON_TSE3_MASK                         0x00000008
#define _TSCON_TSE3_LENGTH                       0x00000001

#define _TSCON_TSE4_POSITION                     0x00000004
#define _TSCON_TSE4_MASK                         0x00000010
#define _TSCON_TSE4_LENGTH                       0x00000001

#define _TSCON_TSE5_POSITION                     0x00000005
#define _TSCON_TSE5_MASK                         0x00000020
#define _TSCON_TSE5_LENGTH                       0x00000001

#define _TSCON_TSE6_POSITION                     0x00000006
#define _TSCON_TSE6_MASK                         0x00000040
#define _TSCON_TSE6_LENGTH                       0x00000001

#define _TSCON_TSE7_POSITION                     0x00000007
#define _TSCON_TSE7_MASK                         0x00000080
#define _TSCON_TSE7_LENGTH                       0x00000001

#define _TSCON_TSE8_POSITION                     0x00000008
#define _TSCON_TSE8_MASK                         0x00000100
#define _TSCON_TSE8_LENGTH                       0x00000001

#define _TSCON_TSE9_POSITION                     0x00000009
#define _TSCON_TSE9_MASK                         0x00000200
#define _TSCON_TSE9_LENGTH                       0x00000001

#define _TSCON_TSE10_POSITION                    0x0000000A
#define _TSCON_TSE10_MASK                        0x00000400
#define _TSCON_TSE10_LENGTH                      0x00000001

#define _TSCON_TSE11_POSITION                    0x0000000B
#define _TSCON_TSE11_MASK                        0x00000800
#define _TSCON_TSE11_LENGTH                      0x00000001

#define _TSCON_TSE12_POSITION                    0x0000000C
#define _TSCON_TSE12_MASK                        0x00001000
#define _TSCON_TSE12_LENGTH                      0x00000001

#define _TSCON_TSE13_POSITION                    0x0000000D
#define _TSCON_TSE13_MASK                        0x00002000
#define _TSCON_TSE13_LENGTH                      0x00000001

#define _TSCON_TSE14_POSITION                    0x0000000E
#define _TSCON_TSE14_MASK                        0x00004000
#define _TSCON_TSE14_LENGTH                      0x00000001

#define _TSCON_TSE15_POSITION                    0x0000000F
#define _TSCON_TSE15_MASK                        0x00008000
#define _TSCON_TSE15_LENGTH                      0x00000001

#define _RSCON_RSE0_POSITION                     0x00000000
#define _RSCON_RSE0_MASK                         0x00000001
#define _RSCON_RSE0_LENGTH                       0x00000001

